// propertyFeatures.config.ts

export const propertyFeatures = [
  {
    id: 1,
    category: "موقعیت ملک",
    type: "select",
    statusType: "options",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "باغ", "دامداری", "مرغداری", "کارخانه", "کارگاه", "سوله", "زیرزمین", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: ["جهت قطعه", "شرقی", "غربی", "شمالی", "جنوبی"],
  },
  {
    id: 2,
    category: "جهت واحد",
    type: "select",
    statusType: "options",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "باغ", "دامداری", "مرغداری", "کارخانه", "کارگاه", "سوله", "زیرزمین", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: ["جهت واحد", "شرقی", "غربی", "شمالی", "جنوبی"],
  },
  {
    id: 3,
    category: "سال ساخت",
    type: "number",
    statusType: "options",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "باغ", "دامداری", "مرغداری", "کارخانه", "کارگاه", "سوله", "زیرزمین", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [],
  },
  {
    id: 3,
    category: "تعداد اتاق خواب",
    type: "number",
    statusType: "options",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "باغ", "دامداری", "مرغداری", "کارخانه", "کارگاه", "سوله", "زیرزمین", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [],
  },
  {
    id: 4,
    category: "تعداد کل طبقات",
    type: "number",
    statusType: "options",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "باغ", "دامداری", "مرغداری", "کارخانه", "کارگاه", "سوله", "زیرزمین", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [],
  },
  {
    id: 5,
    category: "طبقه",
    type: "number",
    statusType: "options",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "باغ", "دامداری", "مرغداری", "کارخانه", "کارگاه", "سوله", "زیرزمین", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [],
  },
  {
    id: 6,
    category: "تعداد کل واحد ها",
    type: "number",
    statusType: "options",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "باغ", "دامداری", "مرغداری", "کارخانه", "کارگاه", "سوله", "زیرزمین", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [],
  },
  {
    id: 7,
    category: "تعداد واحد ها در هر طبقه",
    type: "number",
    statusType: "options",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "باغ", "دامداری", "مرغداری", "کارخانه", "کارگاه", "سوله", "زیرزمین", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [],
  },
  {
    id: 7,
    category: "تعداد پارکینگ",
    type: "number",
    statusType: "options",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "باغ", "دامداری", "مرغداری", "کارخانه", "کارگاه", "سوله", "زیرزمین", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [],
  },
  {
    id: 8,
    category: "متراژ بنا",
    type: "number",
    statusType: "options",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "باغ", "دامداری", "مرغداری", "کارخانه", "کارگاه", "سوله", "زیرزمین", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [],
  },
  {
    id: 9,
    category: "متراژ زمین",
    type: "number",
    statusType: "options",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "باغ", "دامداری", "مرغداری", "کارخانه", "کارگاه", "سوله", "زیرزمین", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [],
  },

  // -----------------------امکانات-----------------------

  {
    id: 10,
    category: "نمای ساختمان",
    type: "select",
    statusType: "features",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [
      "چوب",
      "کلاسیک",
      "مدرن",
      "سنگ",
      "سیمان",
      "آجر",
      "کامپوزیت",
      "شیشه",
      "ترکیبی",
      "آجر سه سانت",
      "سرامیک",
      "سیمان سفید",
    ],
  },
  {
    id: 11,
    category: "پوشش کف",
    type: "select",
    statusType: "features",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "سالن", "سوئیت"],
      dealType: "all",
      statusType: "features",
    },
    features: ["سرامیک", "پارکت", "موکت", "سنگ", "موزاییک", "سیمان"],
  },
  {
    id: 12,
    category: "امتیازات",
    type: "checkbox",
    statusType: "features",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "باغ", "دامداری", "مرغداری", "کارخانه", "کارگاه", "سوله", "زیرزمین", "سالن", "سوئیت", "زمین"],
      dealType: "all",
    },
    features: ["آب", "برق", "گاز", "تلفن"],
    icons: ["ri-water-percent-fill", "", "ri-gas-station-fill", "ri-cellphone-line"],
  },
  {
    id: 13,
    category: "مشخصات ملک",
    type: "checkbox",
    statusType: "features",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "باغ", "دامداری", "مرغداری", "کارخانه", "کارگاه", "سوله", "زیرزمین", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [
      "دوبلکس",
      "پنت هاوس",
      "لاکچری",
      "فول امکانات",
      "نشینمن مجزا",
      "برج باغ",
      "اختلاف سطح",
      "بازسازی شده",
      "دربست",
      "راه جدا",
      "راه مشترک",
      "خام",
    ],
    icons: ["", "", "", ""],
  },
  {
    id: 14,
    category: "مشاعات",
    type: "checkbox",
    statusType: "features",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [
      "آسانسور",
      "لابی",
      "روف گاردن",
      "کاروا",
      "سالن اجتماعات",
      "سالن ورزشی",
      "استخر",
      "سونا",
      "جکوزی",
    ],
    icons: ["", "", "", ""],
  },
  {
    id: 15,
    category: "تاسیسات سرمایش و گرمایش",
    type: "checkbox",
    statusType: "features",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [
      "اسپلیت",
      "داکت اسپلیت",
      "کول آبی",
      "پکیج و رادیاتور",
      "گرمایش از کف",
      "بخاری",
      "هواساز",
      "موتورخانه مرکزی",
      "چیلر",
    ],
    icons: ["", "", "", ""],
  },
  {
    id: 16,
    category: "آشپزخانه",
    type: "checkbox",
    statusType: "features",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [
      "ام دی اف",
      "چوب",
      "فلزی",
      "جزیره",
      "مدرن",
      "کلاسیک",
      "صفحه سنگ",
      "صفحه کورین",
      "صفحه چوب اپن",
      "لاندری",
      "فول فرنیش",
      "هود",
      "گاز رومیزی",
      "مطبخ",
      "هایگلس",
      "ممبران",
      "فر توکار",
    ],
    icons: ["", "", "", ""],
  },
  {
    id: 17,
    category: "سرویس بهداشتی و حمام",
    type: "checkbox",
    statusType: "features",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: ["ایرانی", "فرنگی", "وان", "جکوزی حمام"],
    icons: ["", "", "", ""],
  },
  {
    id: 18,
    category: "سقف و دیوار",
    type: "checkbox",
    statusType: "features",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [
      "نقاشی",
      "گچ",
      "سنگ",
      "کاغذ دیواری",
      "پارچه کوبی",
      "چوبکاری",
      "گچ بری",
      "کناف",
      "رابیتس",
      "پتینه",
      "ورق طلا",
      "آیینه کاری",
    ],
    icons: ["", "", "", ""],
  },
  {
    id: 19,
    category: "نوع پارکینگ",
    type: "checkbox",
    statusType: "features",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [
      "پارکینگ مشاع",
      "پارکینگ اختصاصی",
      "پارکینگ مزاحم",
      "مسقف",
      "غیر مسقف",
      "باکس",
    ],
    icons: ["", "", "", ""],
  },
  {
    id: 20,
    category: "سایر امکانات",
    type: "checkbox",
    statusType: "features",
    condition: {
      propertyType:
        ["آپارتمان", "ویلا", "حیاط دار", "دفتر کار", "مغازه", "مستغلات", "کلنگی", "انبار", "هتل", "سالن", "سوئیت"],
      dealType: "all",
    },
    features: [
      "تراس",
      "خواب مستر",
      "پاسیو",
      "بالکن",
      "درب ضد سرقت",
      "برق اضطراری",
      "شومینه",
      "آیفون تصویری",
      "کمد دیواری",
      "انباری",
      "اینترنت مرکزی",
      "ماهواره مرکزی",
      "آنتن مرکزی",
      "شوتینگ زباله",
      "جاروبرقی مرکزی",
      "باربیکیو",
      "اطفای حریق",
      "اعلام حریق",
      "دوربین مدار بسته",
      "نیمه مبل",
      "مبله کامل",
      "BMS",
      "سوئیت مجزا",
      "درب ریموت دار",
      "سرایداری",
      "پنجره دو جداره",
      "لوستر",
      "پرده",
      "نورپردازی",
      "حیات اختصاصی",
      "آلاچیق",
    ],
    icons: ["", "", "", ""],
  },
];
